Table of Contents
 Class MprlRecord
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Parameter which represts the general record in IDEA MPRL
[DataContract]
[Serializable]
[KnownType(typeof(AnchorParam))]
[KnownType(typeof(BoltParam))]
[KnownType(typeof(CrossSectionParam))]
[KnownType(typeof(MaterialParam))]
[KnownType(typeof(WeldParam))]
public class MprlRecord
Inheritance
object
MprlRecord
Derived
BoltParam
CrossSectionParam
MaterialParam
WeldParam
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 ItemId
Mprl ItemId
[DataMember]
public Guid ItemId { get; set; }
Property Value
Guid
 Name
Name of the item
[DataMember]
public string Name { get; set; }
Property Value
string
 TableId
Mprl TableId
[DataMember]
public Guid TableId { get; set; }
Property Value
Guid
 Edit this page